package com.tadpole.cloud.operationManagement.modular.stock.constants;

/**
 * 字典类型异常枚举
 *
 * @author lsy
 */
public  class ProductConstants {

    /**
     * EBMS系统人员信息缓存 KEY 前缀
     */
    public static String EBMS_USER_INFO_PREFIX="EBMS_USER_INFO_PREFIX_";


    public static String FILE_RENAME_NO_PREFIX="FILE_RENAME_NO_PREFIX_";

    public static String PRE_PUR_REQ_NO_PREFIX_="PRE_PUR_REQ_NO_PREFIX_";

    public static String ORDER_DEMAN_NO_PREFIX="FILE_RENAME_NO_PREFIX_";
    public static String PUR_REQUIRE_NO_PREFIX="PUR_REQUIRE_NO_PREFIX";

    public static String PRE_MAT_NO_PREFIX_="PRE_MAT_NO_PREFIX_";

    public static String RANDOM_STRING_NO_PREFIX="RANDOM_STRING_NO_PREFIX_";
    /**
     * EBMS系统人员信息缓存过期时间1小时
     */
    public static long EBMS_USER_INFO_EXPIRE_SECONDS=3600L;

    /**
     *
     */
    public static String PRODUCT_OBJECT_LOG_APP_NAME="PRODUCT";

    /**
     *redis生成序列编号
     */
    public static String PRODUCT_GENERATOR_NO="PRODUCT_GENERATOR_NO_KEY_";

    /**
     * 提案管理枚举
     */
    public enum ProposalStatusEnum {


        上新模式_选品("选品", "选品"),
        上新模式_精品("精品", "精品"),
        上新模式_自主设计("自主设计", "自主设计"),


        新品开发状态_提案成功超时("提案成功-超时","提案成功-超时"),
        新品开发状态_提案成功正常("提案成功-正常","提案成功-正常"),
        新品开发状态_提案失败超时("提案失败-超时","提案失败-超时"),
        新品开发状态_提案失败正常("提案失败-正常","提案失败-正常"),
        新品开发状态_未完结超时("未完结-超时","未完结-超时"),
        新品开发状态_未完结正常("未完结-正常","未完结-正常"),


        采购推样开发类型_全新品("全新品","全新品"),

        预提案开发类型_全新品("全新品","全新品"),


        预提案反馈状态_待反馈("待反馈","待反馈"),
        预提案反馈状态_已完结("已完结","已完结"),


        预提案反馈状态_已反馈("已反馈","已反馈"),

        预提案编辑类型_提交("提交","提交"),

        预提案状态_待发布("待发布","待发布"),
        预提案状态_待反馈("待反馈","待反馈"),
        预提案状态_已完结("已完结","已完结"),


        提案状态_新提案("新提案", "新提案"),

        提案开发类型_全新品("全新品", "全新品"),

        提案状态_开发测试反馈("开发测试反馈", "开发测试反馈"),

        提案状态_提案完结("提案完结", "提案完结"),

        提案状态_归档("提案完结", "提案完结"),

        拿样任务发布状态_已发布("已发布", "已发布"),
        拿样任务发布状态_待发布("待发布", "待发布"),

        拿样任务开关状态_开启("开启", "开启"),
        拿样任务开关状态_关闭("关闭", "关闭"),

//
//     ProposalSampleRegist.registStatus
//        样品登记信息状态-值域{"信息登记"，"待开发反馈"，"待运营反馈"，"已结项"，"未通过"，"已通过"}；-Sample registration information status
        样品登记信息状态_信息登记("信息登记","信息登记"),
        样品登记信息状态_待开发反馈("待开发反馈","待开发反馈"),
        样品登记信息状态_待运营反馈("待运营反馈","待运营反馈"),
        样品登记信息状态_已结项("已结项","已结项"),
        样品登记信息状态_未通过("未通过","未通过"),
        样品登记信息状态_已通过("已通过","已通过"),
        样品登记信息状态_已完结("已完结","已完结"),//已完结状态 包含 （未通过，已通过）
        样品登记信息状态_系统补充数据("系统补充数据","系统补充数据"),


        开发反馈结果_通过("通过","通过"),
        开发反馈结果_归档("归档","归档"),
        开发反馈结果_采购跟进("采购跟进","采购跟进"),


        运营反馈状态_待反馈("待反馈","待反馈"),
        运营反馈状态_待开发反馈("待开发反馈","待开发反馈"),
        运营反馈状态_已反馈("已反馈","已反馈"),
        运营结论_同意("同意","同意"),
        运营结论_不同意("不同意","不同意"),
        运营结论_开发归档("开发归档","开发归档"),


      采购推样_待发布("待发布","待发布"),
      采购推样_待处理("待处理","待处理"),
      采购推样_已处理("已处理","已处理"),

      需求管理新品类型_全新品("全新品","全新品"),
      需求管理新品类型_老品拓新("老品拓新","老品拓新"),
      需求管理新品拓展类型_老品改良("老品改良","老品改良"),
      需求管理新品拓展类型_拓新设计("拓新设计","拓新设计"),

      需求管理状态_待发布("待发布","待发布"),
      需求管理状态_待反馈("待反馈","待反馈"),
      需求管理状态_已完结("已完结","已完结"),

      需求管理反馈_需求完善("需求完善","需求完善"),
      需求管理反馈_开发("开发","开发"),
      需求管理反馈_不开发("不开发","不开发"),


      需求管理提交类型_提交("提交","提交"),


        提案来源_采购推样("采购推样","采购推样"),
        提案来源_运营新品开发需求("运营新品开发需求","运营新品开发需求"),
        提案来源_开发预提案("开发预提案","开发预提案"),



        下单需求_整理中("整理中","整理中"),
        下单需求_已确定("已确定","已确定"),


        预建物料_开发审核状态_待提交("待提交","待提交"),
        预建物料_开发审核状态_已提交("已提交","已提交"),
        预建物料_开发审核状态_归档("归档","归档"),

        预建物料_采购审核状态_待提交("待提交","待提交"),
        预建物料_采购审核状态_已提交("已提交","已提交"),
        预建物料_采购审核状态_归档("归档","归档"),


        预建物料_运营审核状态_待审核("待审核","待审核"),
        预建物料_运营审核状态_已审核("已审核","已审核"),
        预建物料_运营审核状态_归档("归档","归档"),


        预建物料_终审审核状态_待审核("待审核","待审核"),
        预建物料_终审审核状态_通过("通过","通过"),
        预建物料_终审审核状态_归档("归档","归档"),

        预建物料_终审审核结果_驳回至开发("驳回至开发","驳回至开发"),
        预建物料_终审审核结果_驳回至采购("驳回至采购","驳回至采购"),
        预建物料_终审审核结果_全部驳回("全部驳回","全部驳回"),
        预建物料_终审审核结果_通过("通过","通过"),

        大货样拿样管理_拿样登记_创建方式_系统创建("系统创建","系统创建"),
        大货样拿样管理_拿样登记_创建方式_人工创建("人工创建","人工创建"),
        大货样拿样管理_拿样登记_拿样登记状态_登记中("登记中","登记中"),
        大货样拿样管理_拿样登记_拿样登记状态_已提交("已提交","已提交"),
        大货样拿样管理_拿样登记_拿样登记状态_已完成("已完成","已完成"),

        大货样拿样管理_拿样登记_样品明细_样品存储状态_封存中("封存中","封存中"),
        大货样拿样管理_拿样登记_样品明细_样品存储状态_借用中("借用中","借用中"),
        大货样拿样管理_拿样登记_样品明细_样品存储状态_已丢失("已丢失","已丢失"),
        大货样拿样管理_拿样登记_样品明细_样品存储状态_已销毁("已销毁","已销毁"),
        大货样拿样管理_拿样登记_样品明细_样品存储状态_已退样("已退样","已退样"),

        大货样拿样管理_拿样登记_样品明细_样品完整程度_样品完好("样品完好","样品完好"),
        大货样拿样管理_拿样登记_样品明细_样品完整程度_外观损坏("外观损坏","外观损坏"),
        大货样拿样管理_拿样登记_样品明细_样品完整程度_功能损坏("功能损坏","功能损坏"),
        大货样拿样管理_拿样登记_样品明细_样品完整程度_完全损坏("完全损坏","完全损坏"),


        大货样拿样管理_拿样登记_样品明细_样品归还方式_原样归还("原样归还","原样归还"),
        大货样拿样管理_拿样登记_样品明细_样品归还方式_报损归还("报损归还","报损归还"),
        大货样拿样管理_拿样登记_样品明细_样品归还方式_丢失("丢失","丢失"),

        大货样拿样管理_拿样登记_样品明细_样品损坏类型_外观损坏("外观损坏","外观损坏"),
        大货样拿样管理_拿样登记_样品明细_样品损坏类型_功能损坏("功能损坏","功能损坏"),
        大货样拿样管理_拿样登记_样品明细_样品损坏类型_完全损坏("完全损坏","完全损坏"),


        大货样拿样管理_拿样登记_样品明细_样品领用状态_领用中("领用中","领用中"),
        大货样拿样管理_拿样登记_样品明细_样品领用状态_已归还("已归还","已归还")


        ;



        ProposalStatusEnum(String code, String message) {
            this.code = code;
            this.message = message;
        }

        private String code;

        private String message;


        public String getCode() {
            return code;
        }

        public void setCode(String code) {
            this.code = code;
        }


        public String getMessage() {
            return message;
        }

        public void setMessage(String message) {
            this.message = message;
        }
    }
}

